In [1]:
import numpy as np

In [2]:
import pandas as pd
from numpy.random import randn

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array
d = {'a':10,'b':20,'c':30}

In [4]:
#Series Session
pd.Series(labels)
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
ser1 = pd.Series([1,2,3,4],['A','B','C','D'])

In [7]:
ser2 = pd.Series([2,4,5,8],['A','B','E','F'])

In [8]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
ser2

A    2
B    4
E    5
F    8
dtype: int64

In [10]:
ser1['A'] + ser2['B']

5

In [11]:
ser1 + ser2

A    3.0
B    6.0
C    NaN
D    NaN
E    NaN
F    NaN
dtype: float64

In [12]:
## Data Frames
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#Column selection
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
##Every row and column are Pandas Series in DataFrame
type(df['W'])

pandas.core.series.Series

In [17]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [18]:
#Create new Column
df['new'] = df['W'] + df['Z']

In [19]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [20]:
##axis 1 when deleting column default value is 0
df.drop('new',axis =1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [22]:
##Remove permenanet
df.drop('new',axis=1 , inplace=True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.drop('E',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [25]:
df.shape

(5, 4)

In [26]:
## Row based selection - label names based selection
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [27]:
Integer based location
df.iloc[2]

SyntaxError: invalid syntax (<ipython-input-27-00f7436da3d9>, line 1)

In [ ]:
df

In [ ]:
df.loc['B','Y']

In [ ]:
df.loc[['A','B'],['X','Y']]

In [ ]:
##Conditional operation on DatFrames = Filtered rows where column W is greater then zero
df[df['W'] > 0]

In [ ]:
df[['W','Y']] > 0

In [ ]:
df[df[['W','Y']] > 0]

In [ ]:
df[df['W'] > 0]

In [ ]:
df[df['W'] > 0][['Y','Z']]

In [ ]:
#Multiple conditional selection - And - &  , Or - 
df[(df['W'] > 0) & (df['Y'] > 1)]

In [ ]:
df

In [ ]:
df[(df['W'] > 0) | (df['Y'] > 1)]

In [33]:
newind = 'CA SA UP MP RJ'.split()

In [34]:
newind

['CA', 'SA', 'UP', 'MP', 'RJ']

In [35]:
df['state'] = newind

In [36]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    SA
C -2.018168  0.740122  0.528813 -0.589001    UP
D  0.188695 -0.758872 -0.933237  0.955057    MP
E  0.190794  1.978757  2.605967  0.683509    RJ

In [37]:
df.set_index('state') #inplace operation has to set true

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
SA     0.651118 -0.319318 -0.848077  0.605965
UP    -2.018168  0.740122  0.528813 -0.589001
MP     0.188695 -0.758872 -0.933237  0.955057
RJ     0.190794  1.978757  2.605967  0.683509

In [38]:
#Missing Data
d = {'A': [1,2,np.nan],'B':[5,np.nan,np.nan],'c':[1,2,3]}

In [39]:
df = pd.DataFrame(d)

In [40]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
df.dropna()

     A    B  c
0  1.0  5.0  1

In [42]:
df.dropna(axis=1) #remove null column

   c
0  1
1  2
2  3

In [43]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [44]:
df.dropna(thresh=1)

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.dropna(thresh=2)

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2

In [46]:
df.fillna(value = 'FILL VLAUE')

            A           B  c
0           1           5  1
1           2  FILL VLAUE  2
2  FILL VLAUE  FILL VLAUE  3

In [48]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [49]:
data = {'Company':['A','A','A','B','B','B','C','C','C'],
       'Person':['p1','p2','p3','p4','p5','p6','p7','p8','p9'],
       'Sales':[200,300,400,100,200,500,700,900,100]}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

  Company Person  Sales
0       A     p1    200
1       A     p2    300
2       A     p3    400
3       B     p4    100
4       B     p5    200
5       B     p6    500
6       C     p7    700
7       C     p8    900
8       C     p9    100

In [54]:
byComp = df.groupby('Company')

In [55]:
byComp.mean()

              Sales
Company
A        300.000000
B        266.666667
C        566.666667

In [56]:
df.groupby('Company').std()

            Sales
Company
A        100.0000
B        208.1666
C        416.3332

In [57]:
df.groupby('Company').count()

         Person  Sales
Company
A             3      3
B             3      3
C             3      3

In [59]:
df.groupby('Company').describe()

        Sales
        count        mean       std    min    25%    50%    75%    max
Company
A         3.0  300.000000  100.0000  200.0  250.0  300.0  350.0  400.0
B         3.0  266.666667  208.1666  100.0  150.0  200.0  350.0  500.0
C         3.0  566.666667  416.3332  100.0  400.0  700.0  800.0  900.0

In [60]:
df.groupby('Company').describe().transpose()

Company          A           B           C
Sales count    3.0    3.000000    3.000000
      mean   300.0  266.666667  566.666667
      std    100.0  208.166600  416.333200
      min    200.0  100.000000  100.000000
      25%    250.0  150.000000  400.000000
      50%    300.0  200.000000  700.000000
      75%    350.0  350.000000  800.000000
      max    400.0  500.000000  900.000000

In [61]:
#Merging joining and Concating
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [62]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [63]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [64]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [65]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [67]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
pd.concat([df1,df2,df3],axis=1) # As here we are doing concat based on row so as df1  don'1 have any row for column 4 to 11

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [69]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [70]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [71]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

Merging
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [72]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [73]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [74]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [75]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [76]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [77]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [78]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [79]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [80]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2